import com.google.common.collect.Lists;
import com.google.common.collect.Sets;
import org.apache.commons.collections.CollectionUtils;
import org.junit.Test;
import org.springframework.boot.json.JacksonJsonParser;

import java.util.ArrayList;
import java.util.List;
import java.util.Map;
import java.util.Set;
import java.util.concurrent.atomic.AtomicInteger;
import java.util.stream.Collectors;

/**
 * Created by dengmingliang on 2020/10/31
 */
public class FlyTest {
  @Test
  public void getDifferentCitys() {
    JacksonJsonParser jacksonJsonParser = new JacksonJsonParser();
    String allCity = "{\"南宁\":[\"毕节\",\"海口\",\"济南\",\"徐州\",\"十堰\",\"哈尔\",\"厦门\",\"赣州\",\"重庆\",\"贵阳\",\"潍坊\",\"绵阳\",\"天津\",\"珠海\",\"青岛\",\"榆林\",\"杭州\",\"怀化\",\"福州\",\"成都\",\"兰州\",\"长沙\",\"滨\",\"揭阳\",\"泸州\",\"呼和浩特\",\"常德\",\"银川\",\"洛阳\",\"南阳\",\"三亚\",\"信阳\",\"西安\",\"宜昌\",\"郑州\",\"襄阳\",\"太原\",\"济宁\",\"北京\",\"南京\"],\"河池\":[\"海口\",\"天津\",\"桂林\",\"长沙\"],\"宜春\":[\"上海\",\"昆明\",\"天津\",\"三亚\",\"珠海\",\"西安\"],\"十堰\":[\"南宁\",\"呼和浩特\",\"长沙\",\"石家庄\"],\"张家界\":[\"徐州\",\"西安\"],\"厦门\":[\"南宁\",\"海口\",\"昆明\",\"阜阳\",\"重庆\",\"丽江\",\"哈尔滨\",\"安庆\",\"合肥\",\"天津\",\"青岛\",\"榆林\",\"南昌\",\"遵义\",\"沈阳\",\"长沙\",\"唐山\",\"乌鲁木齐\",\"常德\",\"南阳\",\"铜仁\",\"三亚\",\"西安\",\"郑州\",\"攀枝花\",\"太原\",\"黄山\",\"北京\"],\"汉中\":[\"广州\",\"银川\",\"南通\",\"大连\",\"贵阳\"],\"石家庄\":[\"海口\",\"成都\",\"昆明\",\"包头\",\"十堰\",\"沈阳\",\"长沙\",\"南通\",\"丽江\",\"乌鲁木齐\",\"呼和浩特\",\"广州\",\"长春\",\"承德\",\"哈尔滨\",\"银川\",\"三亚\",\"桂林\",\"西安\",\"榆林\",\"杭州\",\"张家口\",\"南京\"],\"邵阳\":[\"海口\",\"西安\"],\"佳木斯\":[\"大连\",\"北京\",\"深圳\"],\"承德\":[\"广州\",\"石家庄\"],\"安庆\":[\"海口\",\"昆明\",\"厦门\",\"宁波\",\"西安\",\"北京\"],\"天津\":[\"南宁\",\"河池\",\"宜春\",\"阜阳\",\"厦门\",\"宁波\",\"贵阳\",\"景德镇\",\"长春\",\"桂林\",\"珠海\",\"锡林浩特\",\"青岛\",\"大连\",\"杭州\",\"赤峰\",\"南昌\",\"福州\",\"舟山\",\"乌海\",\"上海\",\"武汉\",\"和田\",\"广州\",\"南阳\",\"三亚\",\"郑州\",\"海口\",\"昆明\",\"临沂\",\"忻州\",\"赣州\",\"重庆\",\"丽江\",\"大同\",\"绵阳\",\"哈尔滨\",\"温州\",\"榆林\",\"成都\",\"庆阳\",\"呼伦贝尔\",\"衡阳\",\"兰州\",\"遵义\",\"长沙\",\"乌鲁木齐\",\"深圳\",\"呼和浩特\",\"常德\",\"信阳\",\"西安\",\"宜昌\",\"烟台\",\"襄阳\"],\"锡林浩特\":[\"呼和浩特\",\" 天津\",\"西安\"],\"赤峰\":[\"呼和浩特\",\"呼伦贝尔\",\"天津\",\"西安\",\"郑州\",\"大连\",\"深圳\"],\"杭州\":[\"南宁\",\"海口\",\"昆明\",\"赣州\",\"重庆\",\"石家庄\",\"贵阳\",\"西双版纳\",\"绵阳\",\"长春\",\"哈尔滨\",\"天津\",\"桂林\",\"珠海\",\"青岛\",\"大连\",\"成都\",\"衡阳\",\"兰州\",\"沈阳\",\"长沙\",\"锦州\",\"乌鲁木齐\",\"和田\",\"深圳\",\"通辽\",\"呼和浩特\",\"广州\",\"银川\",\"三亚\",\"恩施\",\"西安\",\"宜昌\",\"郑州\",\"烟台\",\"太原\",\"北京\"],\"怀化\":[\"南宁\",\"海口\",\"济南\",\"三亚\",\"北海\",\"西安\",\"青岛\",\"郑州\"],\"福州\":[\"南宁\",\"海口\",\"昆明\",\"徐州\",\"临沂\",\"重庆\",\"贵阳\",\"哈尔滨\",\"淮安\",\"天津\",\"桂林\",\"青岛\",\"大连\",\"舟山\",\"上海\",\"遵义\",\"沈阳\",\"长沙\",\"南通\",\"呼和浩特\",\"三亚\",\"恩施\",\"西安\",\"宜昌\",\"郑州\",\"襄阳\",\"太原\",\"北京\"],\"舟山\":[\"福州\",\"惠州\",\"徐州\",\"天津\",\"大连\"],\"三明\":[\"海口\",\"广州\",\"南京\"],\"和田\":[\"天津\",\"乌鲁木齐\",\"杭州\",\"深圳\",\"北京\"],\"广州\":[\"东营\",\"海口\",\"秦皇岛\",\"庄\",\"昆明\",\"汉中\",\"宁波\",\"重庆\",\"丽江\",\"潍坊\",\"长春\",\"承德\",\"哈尔滨\",\"天津\",\"温州\",\"青岛\",\"大连\",\"杭州\",\"成都\",\"乌海\",\"上海\",\"兰州\",\"沈阳\",\"锦州\",\"三明\",\"石家\",\"呼和浩特\",\"银川\",\"三亚\",\"西安\",\"郑州\",\"张家口\",\"太原\",\"北京\",\"南京\"],\"邯郸\":[\"海口\",\"珠海\"],\"郑州\":[\"南宁\",\"厦门\",\"宁波\",\"贵阳\",\"西双版纳\",\"长春\",\"天津\",\"桂林\",\"珠海\",\"青岛\",\"大连\",\"杭州\",\"怀化\",\"赤峰\",\"福州\",\"连城\",\"乌海\",\"沈阳\",\"广州\",\"银川\",\"三亚\",\"攀枝花\",\"海口\",\"格尔木\",\"昆明\",\"喀什\",\"赣州\",\"北海\",\"重庆\",\"丽江\",\"绵阳\",\"哈尔滨\",\"温州\",\"阿克苏\",\"兴义\",\"成都\",\"呼伦贝尔\",\"衡阳\",\"兰州\",\"遵义\",\"湛江\",\"揭阳\",\"乌鲁木齐\",\"深圳\",\"呼和浩特\",\"惠州\",\"西宁\",\"拉萨\",\"铜仁\",\"晋江\",\"恩施\",\"库尔勒\"],\"攀枝花\":[\"济南\",\"厦门\",\"桂林\",\"重庆\",\"郑州\"],\"宁蒗\":[\"成都\",\"昆明\"],\"黄山\":[\"呼和浩特\",\"厦门\",\"桂林\",\"西安\"],\"南京\":[\"南宁\",\"海口\",\"连城\",\"昆明\",\"兰州\",\"赣州\",\"重庆\",\"丽江\",\"石家庄\",\"三明\",\"深圳\",\"贵阳\",\"绵阳\",\"呼和浩特\",\"广州\",\"哈尔滨\",\"三亚\",\"桂林\",\"恩施\",\"西安\",\"大连\",\"太原\"],\"毕节\":[\"西宁\",\"西安\"],\"海口\":[\"南宁\",\"河池\",\"阜阳\",\"厦门\",\"宁波\",\"石家庄\",\"邵阳\",\"贵阳\",\"潍坊\",\"景德镇\",\"长春\",\"安庆\",\"合肥\",\"天津\",\"桂林\",\"珠海\",\"青岛\",\"大连\",\"杭州\",\"怀化\",\"南昌\",\"福州\",\"上海\",\"沈阳\",\"三明\",\"武汉\",\"巴中\",\"广州\",\"银川\",\"南阳\",\"百色\",\"邯郸\",\"郑州\",\"太原\",\"万州\",\"南京\",\"临汾\",\"昆明\",\"济南\",\"包头\",\"徐州\",\"临沂\",\"赣州\",\"重庆\",\"营口\",\"绵阳\",\"哈尔滨\",\"淮安\",\"成都\",\"陇南\",\"衡阳\",\"兰州\",\"遵义\",\"长沙\",\"湛江\",\"揭阳\",\"岳阳\",\"泸州\",\"乌鲁木齐\",\"深圳\",\"运城\",\"盐城\",\"呼和浩特\",\"梅州\",\"常德\",\"洛阳\",\"信阳\",\"西安\",\"宜昌\",\"济宁\",\"北京\"],\"格尔木\":[\"拉萨\",\"郑州\"],\"徐州\":[\"南宁\",\"福州\",\"海口\",\"舟山\",\"兰州\",\"昆明\",\"张家界\",\"长沙\",\"重庆\",\"丽江\",\"深圳\",\"贵阳\",\"绵阳\",\"惠州\",\"晋江\",\"桂林\",\"南昌\"],\"忻州\":[\"天津\",\"贵阳\"],\"北海\":[\"桂林\",\"西安\",\"郑州\",\"怀化\"],\"喀什\":[\"兰州\",\"银川\",\"郑州\",\"乌鲁木齐\"],\"重庆\":[\"南宁\",\"厦门\",\"宁波\",\"西双版纳\",\"天津\",\"合肥\",\"桂林\",\"珠海\",\"青岛\",\"大连\",\"杭州\",\"南昌\",\"福州\",\"上海\",\"沈阳\",\"广州\",\"日喀则\",\"三亚\",\"郑州\",\"攀枝花\",\"太原\",\"万州\",\"南京\",\"海口\",\"昆明\",\"济南\",\"徐州\",\"赣州\",\"丽江\",\"哈尔滨\",\"温州\",\"榆林\",\"呼伦贝尔\",\"兰州\",\"长沙\",\"湛江\",\"揭阳\",\"乌鲁木齐\",\"深圳\",\"呼和浩特\",\"西宁\",\"拉萨\",\"洛阳\",\"晋江\",\"西安\",\"昌都\",\"济宁\",\"北京\",\"库尔勒\"],\"营口\":[\"潍坊\",\"海口\",\"济南\",\"上海\",\"长沙\",\"西安\",\"烟台\"],\"哈尔滨\":[\"南宁\",\"海口\",\"秦皇岛\",\"昆明\",\"庄\",\"济南\",\"厦门\",\"赣州\",\"重庆\",\"天津\",\"合肥\",\"杭州\",\"福州\",\"呼伦贝尔\",\"上海\",\"遵义\",\"长沙\",\"锦州\",\"唐山\",\"松原\",\"石家\",\"深圳\",\"通辽\",\"呼和浩特\",\"广州\",\"三亚\",\"西安\",\"宜昌\",\"郑州\",\"张家口\",\"太原\",\"北京\",\"南京\"],\"淮安\":[\"福州\",\"海口\",\"呼和浩特\",\"西安\"],\"阿克苏\":[\"郑州\",\"乌鲁木齐\"],\"兴义\":[\"西双版纳\",\"三亚\",\"西安\",\"郑州\"],\"庆阳\":[\"兰州\",\"天津\"],\"兰州\":[\"南宁\",\"海口\",\"昆明\",\"济南\",\"徐州\",\"临沂\",\"喀什\",\"重庆\",\"贵阳\",\"绵阳\",\"天津\",\"合肥\",\"珠海\",\"榆林\",\"杭州\",\"南昌\",\"福州\",\"成都\",\"庆阳\",\"乌海\",\"陇南\",\"衡阳\",\"长沙\",\"泸州\",\"乌鲁木齐\",\"武汉\",\"深圳\",\"广州\",\"三亚\",\"恩施\",\"郑州\",\"襄阳\",\"北京\",\"南京\"],\"遵义\":[\"福州\",\"海口\",\"银川\",\"哈尔滨\",\"天津\",\"厦门\",\"三亚\",\"桂林\",\"长沙\",\"西安\",\"郑州\",\"大连\"],\"湛江\":[\"海口\",\"济南\",\"昆明\",\"三亚\",\"赣州\",\"重庆\",\"西安\",\"郑州\",\"贵阳\"],\"锦州\":[\"广州\",\"昆明\",\"哈尔滨\",\"杭州\"],\"唐山\":[\"哈尔滨\",\"沈阳\",\"厦门\",\"桂林\",\"西安\",\"大连\",\"深圳\",\"贵阳\"],\"乌鲁木齐\":[\"东营\",\"海口\",\"南充\",\"临沂\",\"厦门\",\"喀什\",\"宁波\",\"重庆\",\"石家庄\",\"绵阳\",\"长春\",\"天津\",\"温州\",\"杭州\",\"阿克苏\",\" 伊宁\",\"那拉提\",\"衡阳\",\"阿勒泰\",\"兰州\",\"长沙\",\"和田\",\"深圳\",\"塔城\",\"呼和浩特\",\"布尔津\",\"西安\",\"郑州\",\"博乐\",\"北京\",\"库车\"],\"深圳\":[\"海口\",\"临汾\",\"昆明\",\"济南\",\"徐州\",\"阜阳\",\"宁波\",\"重庆\",\"佳木斯\",\"贵阳\",\"潍坊\",\"齐\",\"哈尔滨\",\"天津\",\"温州\",\"青岛\",\"大连\",\"杭州\",\"赤峰\",\"成都\",\"呼伦贝尔\",\"上海\",\"兰州\",\"乌鲁木\",\"唐山\",\"和田\",\"呼和浩特\",\"梅州\",\"铜仁\",\"三亚\",\"西安\",\"宜昌\",\"郑州\",\"太原\",\"北京\",\"南京\"],\"呼和浩特\":[\"南宁\",\"海口\",\"昆明\",\"济南\",\"十堰\",\"临沂\",\"宁波\",\"重庆\",\"石家庄\",\"贵阳\",\"哈尔滨\",\"淮安\",\"天津\",\"合肥\",\"温州\",\"桂林\",\"锡林浩特\",\"青岛\",\"大连\",\"杭州\",\"赤峰\",\"南昌\",\"福州\",\"成都\",\"乌海\",\"呼伦贝尔\",\"沈阳\",\"长沙\",\"南通\",\"乌鲁木齐\",\"武汉\",\"深圳\",\"通辽\",\"广州\",\"三亚\",\"西安\",\"宜昌\",\"郑州\",\"太原\",\"黄山\",\"南京\"],\"池州\":[\"晋江\",\"西安\",\"青岛\",\"贵阳\"],\"拉萨\":[\"成都\",\"格尔木\",\"西宁\",\"合肥\",\"重庆\",\"郑州\"],\"常德\":[\"南宁\",\"海口\",\"天津\",\"厦门\"],\"洛阳\":[\"南宁\",\"海口\",\"三亚\",\"珠海\",\"重庆\"],\"铜仁\":[\"厦门\",\"西安\",\"郑州\",\"深圳\"],\"晋江\":[\"池州\",\"济南\",\"徐州\",\"长沙\",\"重庆\",\"西安\",\"宜昌\",\"郑州\",\"贵阳\"],\"恩施\":[\"福州\",\"兰州\",\"西安\",\"郑州\",\"杭州\",\"武汉\",\"南京\"],\"信阳\":[\"南宁\",\"海口\",\"天津\"],\"张家口\":[\"成都\",\"广州\",\"哈尔滨\",\"石家庄\"],\"襄阳\":[\"南宁\",\"福州\",\"兰州\",\"济南\",\"天津\",\"三亚\",\"西安\",\"青岛\",\"南昌\",\"贵阳\"],\"北京\":[\"南宁\",\"东营\",\"厦门\",\"宁波\",\"佳木斯\",\"贵阳\",\"潍坊\",\"西双版纳\",\"长春\",\"安庆\",\"合肥\",\"桂林\",\"珠海\",\"大连\",\"杭州\",\"南昌\",\"福州\",\"芒市\",\"乌海\",\"上海\",\"玉树\",\"武汉\",\"和田\",\"广州\",\"银川\",\"三亚\",\"博鳌\",\"海口\",\"昆明\",\"重庆\",\"丽江\",\"牡丹江\",\"哈尔滨\",\"满洲里\",\"延安\",\"温州\",\"榆林\",\"二连浩特\",\"成都\",\"呼伦贝尔\",\"兰州\",\"长沙\",\"揭阳\",\"乌鲁木齐\",\"鸡西\",\"深圳\",\"西宁\",\"梅州\",\"西安\",\"宜昌\",\"腾冲\"],\"库尔勒\":[\"重庆\",\"郑州\"],\"东营\":[\"广州\",\"三亚\",\"西安\",\"大连\",\"乌鲁木齐\",\"武汉\",\"北京\"],\"昭通\":[\"西双版纳\",\"成都\"],\"秦皇岛\":[\"广州\",\"哈尔滨\",\"西安\",\"松原\"],\"阜阳\":[\"海口\",\"昆明\",\"天津\",\"厦门\",\"深圳\"],\"澜沧\":[\"成都\",\"昆明\"],\"宁波\":[\"海口\",\"昆明\",\"长沙\",\"赣州\",\"重庆\",\"乌鲁木齐\",\"深圳\",\"贵阳\",\"潍坊\",\"呼和浩特\",\"景德镇\",\"广州\",\"安庆\",\"天津\",\"西安\",\"宜昌\",\"大连\",\"郑州\",\"北京\"],\"贵阳\":[\"南宁\",\"海口\",\"济南\",\"徐州\",\"忻州\",\"汉中\",\"宁波\",\"丽江\",\"天津\",\"合肥\",\"温州\",\"珠海\",\"青岛\",\"大连\",\"杭州\",\"福州\",\"上海\",\"兰州\",\"沈阳\",\"湛江\",\"揭阳\",\"唐山\",\"武汉\",\"深圳\",\"盐城\",\"呼和浩特\",\"池州\",\"三亚\",\"晋江\",\"西安\",\"宜昌\",\"郑州\",\"太原\",\"襄阳\",\"济宁\",\"北京\",\"南京\"],\"潍坊\":[\"南宁\",\"海口\",\"上海\",\"沈阳\",\"宁波\",\"营口\",\"深圳\",\"广州\",\"三亚\",\"桂林\",\"西安\",\"大连\",\"北京\"],\"西双版纳\":[\"芒市\",\"成都\",\"昭通\",\"昆明\",\"重庆\",\"丽江\",\"泸州\",\"绵阳\",\"大理\",\"西安\",\"腾冲\",\"郑州\",\"杭州\",\"北京\",\"兴义\"],\"景德镇\":[\"海口\",\"天津\",\"宁波\",\"西安\"],\"长春\":[\"海口\",\"济南\",\"长沙\",\"赣州\",\"石家庄\",\"乌鲁木齐\",\"广州\",\"天津\",\"合肥\",\"三亚\",\"西安\",\"郑州\",\"烟台\",\"杭州\",\"太原\",\"北京\"],\"合肥\":[\"海口\",\"成都\",\"兰州\",\"昆明\",\"沈阳\",\"厦门\",\"重庆\",\"丽江\",\"贵阳\",\"绵阳\",\"呼和浩特\",\"西宁\",\"拉萨\",\"长春\",\"哈尔滨\",\"三亚\",\"桂林\",\"珠海\",\"青岛\",\"西安\",\"大连\",\"太原\",\"北京\"],\"桂林\":[\"河池\",\"海口\",\"济南\",\"临沂\",\"赣州\",\"北海\",\"重庆\",\"石家庄\",\"大同\",\"潍坊\",\"天津\",\"合肥\",\"呼和\",\"大连\",\"杭州\",\"福州\",\"遵义\",\"沈阳\",\"唐山\",\"三亚\",\"西安\",\"郑州\",\"攀枝花\",\"浩特\",\"太原\",\"扬州\",\"黄山\",\"北京\",\"南京\"],\"珠海\":[\"南宁\",\"海口\",\"宜春\",\"昆明\",\"济南\",\"重庆\",\"贵阳\",\"天津\",\"合肥\",\"温州\",\"大连\",\"杭州\",\"连城\",\"赣\",\"上海\",\"兰州\",\"台州\",\"长沙\",\"武汉\",\"洛阳\",\"三亚\",\"西安\",\"邯郸\",\"郑州\",\"太原\",\"北京\"],\"青岛\":[\"南宁\",\"海口\",\"昆明\",\"厦门\",\"重庆\",\"贵阳\",\"合肥\",\"天津\",\"温州\",\"榆林\",\"杭州\",\"怀化\",\"南昌\",\"福州\",\"成都\",\"长沙\",\"武汉\",\"深圳\",\"呼和浩特\",\"池州\",\"广州\",\"南阳\",\"西安\",\"郑州\",\"襄阳\"],\"大连\":[\"东营\",\"昆明\",\"汉中\",\"宁波\",\"重庆\",\"佳木斯\",\"大同\",\"贵阳\",\"潍坊\",\"天津\",\"合肥\",\"桂林\",\"珠海\",\"杭州\",\"威海\",\"赤峰\",\"福州\",\" 海口\",\"舟山\",\"上海\",\"遵义\",\"长沙\",\"唐山\",\"深圳\",\"呼和浩特\",\"广州\",\"三亚\",\"西安\",\"郑州\",\"烟台\",\"太原\",\"北京\",\"南京\"],\"威海\":[\"上海\",\"大连\"],\"南昌\":[\"海口\",\"兰州\",\"昆明\",\"济南\",\"徐州\",\"厦门\",\"揭阳\",\"重庆\",\"泸州\",\"丽江\",\"呼和浩特\",\"天津\",\"三亚\",\"西安\",\"青岛\",\"襄阳\",\"北京\"],\"芒市\":[\"西双版纳\",\"昆明\",\"西安\",\"北京\"],\"连城\":[\"昆明\",\"珠海\",\"郑州\",\"南京\"],\"乌海\":[\"呼和浩特\",\"广州\",\"兰州\",\"天津\",\"西安\",\"郑州\",\"北京\"],\"上海\":[\"福州\",\"海口\",\"成都\",\"宜春\",\"昆明\",\"长沙\",\"丽江\",\"营口\",\"深圳\",\"贵阳\",\"潍坊\",\"绵阳\",\"广州\",\"梅州\",\"哈尔滨\",\"天津\",\"三亚\",\"博鳌\",\"珠海\",\"西安\",\"大连\",\"威海\",\"北京\"],\"玉树\":[\"西宁\",\"北京\"],\"沈阳\":[\"福州\",\"海口\",\"呼伦贝尔\",\"衡阳\",\"厦门\",\"重庆\",\"唐山\",\"丽江\",\"石家庄\",\"武汉\",\"贵阳\",\"潍坊\",\"呼和浩特\",\"广州\",\"合肥\",\"三亚\",\"桂林\",\"西安\",\"郑州\",\"杭州\",\"扬州\"],\"南通\":[\"福州\",\"呼和浩特\",\"银川\",\"临沂\",\"汉中\",\"石家庄\",\"太原\"],\"武汉\":[\"东营\",\"海口\",\"昆明\",\"兰州\",\"沈阳\",\"丽江\",\"贵阳\",\"呼和浩特\",\"天津\",\"三亚\",\"恩施\",\"珠海\",\"青岛\",\"北京\"],\"巴中\":[\"海口\",\"西安\"],\"大理\":[\"西双版纳\",\"绵阳\",\"昆明\",\"泸州\"],\"银川\":[\"海口\",\"遵义\",\"南通\",\"汉中\",\"喀什\",\"石家庄\",\"松原\",\"绵阳\",\"广州\",\"三亚\",\"西安\",\"郑州\",\"南宁杭州\",\"北京\"],\"南阳\":[\"南宁\",\"海口\",\"天津\",\"厦门\",\"揭阳\",\"西安\",\"青岛\"],\"三亚\":[\"南宁\",\"东营\",\"宜春\",\"昆明\",\"济南\",\"临沂\",\"厦门\",\"赣州\",\"重庆\",\"石家庄\",\"贵阳\",\"潍坊\",\"绵阳\",\"长春\",\"哈尔滨\",\"天津\",\"合肥\",\"桂林\",\"珠海\",\"大连\",\"杭州\",\"怀化\",\"南昌\",\"兴义\",\"福州\",\"成都\",\"上海\",\"兰州\",\"遵义\",\"沈阳\",\"长沙\",\"湛江\",\"揭阳\",\"武汉\",\"深圳\",\"盐城\",\"呼和浩特\",\"广州\",\"银川\",\"洛阳\",\"西安\",\"宜昌\",\"郑州\",\"太原\",\"扬州\",\"襄阳\",\"北京\",\"南京\"],\"百色\":[\"海口\",\"西安\"],\"太原\":[\"南宁\",\"福州\",\"海口\",\"呼伦贝尔\",\"昆明\",\"长沙\",\"厦门\",\"南通\",\"重庆\",\"贵阳\",\"深圳\",\"呼和浩特\",\"广州\",\"长春\",\"哈尔滨\",\"合肥\",\"三亚\",\"桂林\",\"珠海\",\"大连\",\"杭州\",\"南京\"],\"万州\":[\"海口\",\"长沙\",\"重庆\"],\"临汾\":[\"海口\",\"深圳\"],\"济南\":[\"南宁\",\"海口\",\"昆明\",\"赣州\",\"重庆\",\"丽江\",\"营口\",\"贵阳\",\"长春\",\"哈尔滨\",\"桂林\",\"珠海\",\"榆林\",\"怀化\",\"南昌\",\"成都\",\"台州\",\"兰州\",\"湛江\",\"松原\",\"深圳\",\"呼和浩特\",\"西宁\",\"三亚\",\"晋江\",\"西安\",\"攀枝花\",\"襄阳\"],\"昆明\":[\"宜春\",\"庄\",\"阜阳\",\"澜沧\",\"厦门\",\"宁波\",\"普洱\",\"西双版纳\",\"安庆\",\"天津\",\"合肥\",\"珠海\",\"青岛\",\"大连\",\"杭州\",\"南昌\",\"福州\",\"芒市\",\"连城\",\"上海\",\"石家\",\"武汉\",\"广州\",\"大理\",\"三亚\",\"郑州\",\"宁蒗\",\"太原\",\"保山\",\"南京\",\"海口\",\"济南\",\"徐州\",\"赣州\",\"重庆\",\"丽江\",\"迪庆\",\"绵阳\",\"哈尔滨\",\"淮安\",\"中卫\",\"温州\",\"成都\",\"兰州\",\"长沙\",\"湛江\",\"锦州\",\"深圳\",\"呼和浩特\",\"临沧\",\"西安\",\"宜昌\",\"腾冲\",\"北京\"],\"南充\":[\"温州\",\"乌鲁木齐\"],\"包头\":[\"海口\",\"石家庄\"],\"临沂\":[\"福州\",\"海口\",\"呼和浩特\",\"兰州\",\"天津\",\"三亚\",\"桂林\",\"长沙\",\"南通\",\"乌鲁木齐\"],\"六盘水\":[\"长沙\",\"西安\"],\"赣州\":[\"南宁\",\"海口\",\"成都\",\"昆明\",\"济南\",\"湛江\",\"宁波\",\"重庆\",\"长春\",\"哈尔滨\",\"天津\",\"三亚\",\"桂林\",\"珠海\",\"西安\",\"郑州\",\"杭州\",\"南京\"],\"丽江\":[\"上海\",\"昆明\",\"徐州\",\"沈阳\",\"厦门\",\"长沙\",\"重庆\",\"泸州\",\"石家庄\",\"武汉\",\"贵阳\",\"西双版纳\",\"广州\",\"济南合肥\",\"天津\",\"西安\",\"郑州\",\"杭州\",\"南京\",\"南昌\",\"北京\"],\"大同\":[\"天津\",\"桂林\",\"大连\"],\"绵阳\":[\"海口\",\"兰州\",\"上海\",\"昆明\",\"徐州\",\"揭阳\",\"乌鲁木齐\",\"西双版纳\",\"大理\",\"银川\",\"天津\",\"合肥\",\"三亚\",\"南宁南京\",\"郑州\",\"杭州\"],\"中卫\":[\"昆明\",\"长沙\"],\"温州\":[\"昆明\",\"南充\",\"长沙\",\"重庆\",\"乌鲁木齐\",\"深圳\",\"贵阳\",\"盐城\",\"广州\",\"天津\",\"特\",\"珠海\",\"西安\",\"青岛\",\"宜昌\",\"郑州\",\"呼和浩\",\"北京\"],\"榆林\":[\"南宁\",\"兰州\",\"济南\",\"天津\",\"厦门\",\"长沙\",\"重庆\",\"西安\",\"青岛\",\"石家庄\",\"松原\",\"北京\"],\"州\":[],\"成都\":[\"南宁\",\"海口\",\"昭通\",\"庄\",\"昆明\",\"济南\",\"澜沧\",\"西双版纳\",\"天津\",\"合肥\",\"青岛\",\"杭州\",\"赣\",\"上海\",\"兰州\",\"石家\",\"深圳\",\"呼和浩特\",\"拉萨\",\"广州\",\"三亚\",\"郑州\",\"张家口\",\"宁蒗\",\"北京\"],\"陇南\":[\"海口\",\"兰州\"],\"呼伦贝尔\":[\"通辽\",\"呼和浩特\",\"哈尔滨\",\"沈阳\",\"天津\",\" 重庆\",\"西安\",\"郑州\",\"赤峰\",\"太原\",\"北京\",\"深圳\"],\"衡阳\":[\"海口\",\"兰州\",\"沈阳\",\"天津\",\"郑州\",\"杭州\",\"乌鲁木齐\"],\"台州\":[\"济南\",\"珠海\"],\"长沙\":[\"南宁\",\"河池\",\"海口\",\"昆明\",\"徐州\",\"十堰\",\"哈尔\",\"临沂\",\"厦门\",\"六盘水\",\"宁波\",\"重庆\",\"丽江\",\"石家庄\",\"营口\",\"长春\",\"天津\",\"中卫\",\"温州\",\"珠海\",\"青岛\",\"大连\",\"榆林\",\"杭州\",\"福州\",\"上海\",\"兰州\",\"遵义\",\"滨\",\"揭阳\",\"乌鲁木齐\",\"日照\",\"呼和浩特\",\"三亚\",\"西安\",\"烟台\",\"太原\",\"万州\",\"济宁\",\"北京\"],\"揭阳\":[\"南宁\",\"海口\",\"长沙\",\"重庆\",\"贵阳\",\"绵阳\",\"南阳\",\"三亚\",\"西安\",\"宜昌\",\"郑州\",\"南昌\",\"北京\"],\"岳阳\":[\"海口\",\"西安\"],\"泸州\":[\"南宁\",\"西双版纳\",\"海口\",\"兰州\",\"大理\",\"丽江\",\"南昌\"],\"松原\":[\"秦皇岛\",\"济南\",\"银川\",\"哈尔滨\",\"西安\",\"榆林\"],\"盐城\":[\"海口\",\"温州\",\"三亚\",\"西安\",\"贵阳\"],\"通辽\":[\"呼和浩特\",\"呼伦贝尔\",\"哈尔滨\",\"西安\",\"杭州\"],\"惠州\":[\"舟山\",\"徐州\",\"西安\",\"郑州\"],\"西宁\":[\"拉萨\",\"济南\",\"玉树\",\"合肥\",\"西安\",\"重庆\",\"郑州\",\"北京\"],\"梅州\":[\"海口\",\"上海\",\"宜昌\",\"深圳\",\"北京\"],\"宜昌\":[\"南宁\",\"福州\",\"海口\",\"昆明\",\"宁波\",\"揭阳\",\"深圳\",\"贵阳\",\"呼和浩特\",\"梅州\",\"哈尔滨\",\"天津\",\"三亚\",\"温州\",\"晋江\",\"西安\",\"杭州\",\"北京\"],\"腾冲\":[\"西双版纳\",\"昆明\",\"北京\"],\"西安\":[\"南宁\",\"东营\",\"宜春\",\"秦皇岛\",\"张家界\",\"贝尔\",\"厦门\",\"宁波\",\"邵阳\",\"石家庄\",\"贵阳\",\"潍坊\",\"西双版纳\",\"景德镇\",\"长春\",\"安庆\",\"天津\",\"合肥\",\"桂林\",\"珠海\",\"锡林浩特\",\"青岛\",\"大连\",\"杭州\",\"怀化\",\"赤峰\",\"南昌\",\"福州\",\"呼伦\",\"芒市\",\"乌海\",\"上海\",\"沈阳\",\"敦煌\",\"巴中\",\"广州\",\"银川\",\"南阳\",\"百色\",\"黄山\",\"南京\",\"毕节\",\"海口\",\"昆明\",\"济南\",\"六盘水\",\"赣州\",\"重庆\",\"丽江\",\"营口\",\"哈尔滨\",\"淮安\",\"温州\",\"榆林\",\"兴义\",\"遵义\",\"长沙\",\"湛江\",\"揭阳\",\"唐山\",\"岳阳\",\"乌鲁木齐\",\"松原\",\"深圳\",\"盐城\",\"通辽\",\"惠州\",\"呼和浩特\",\"西宁\",\"池州\",\"哈密\",\"铜仁\",\"晋江\",\"恩施\",\"宜昌\",\"烟台\",\"襄阳\",\"北京\"],\"烟台\":[\"长春\",\"天津\",\"长沙\",\"西安\",\"大连\",\"杭州\",\"营口\",\"济宁\"],\"济宁\":[\"南宁\",\"海口\",\"长沙\",\"重庆\",\"烟台\",\"贵阳\"],\"扬州\":[\"沈阳\",\"三亚\",\"桂林\"]}";
    jacksonJsonParser.parseMap(allCity);
//    parseFromCityToCity(jacksonJsonParser.parseMap(allCity));
  }


  private void parseFromCityToCity(Map<String, Set<String>> fromCityToCities) {
    // 尝试找出从北京飞出，经由n趟飞行能够再飞回到北京的所有路线
    String fromCity = "北京";
    String assignedCity = "北京";
    List<String> result = new ArrayList<>();
    Integer flyTimes = 5;
    Long now = System.currentTimeMillis();
//    fromCityToCities.get(fromCity).forEach(currentCity -> {
//      String currentFlyRoad = fromCity;
//      getTheRestCitiesByNeedFlyTimes(fromCityToCities, currentCity, flyTimes - 1, flyTimes - 1, currentFlyRoad + "->" + currentCity, assignedCity, result, false);
//    });
//    System.out.println("firstCost:" + (System.currentTimeMillis() - now));
    Set<String> mustViaSomeCities = Sets.newHashSet("西安", "成都", "上海");
    AtomicInteger count = new AtomicInteger(0);
//    result.stream()
//        .filter(flyRoad -> CollectionUtils.isEmpty(mustViaSomeCities) ? true : mustViaSomeCities.stream().allMatch(flyRoad::contains))
//        .forEach(road -> {
//          mustViaSomeCities.forEach(needntShowCity -> road.replaceAll(needntShowCity, "").replaceAll("->", ""));
//          System.out.println(road);
//          count.incrementAndGet();
//        });
//    System.out.println("all result size=" + result.size());
//    System.out.println("match condition result size=" + count.get());
//    System.out.println(fromCityToCities.get(assignedCity));
//
//    now = System.currentTimeMillis();
    List<List<String>> result2 = new ArrayList<>();
    fromCityToCities.get(fromCity).forEach(currentCity -> {
      getTheRestCitiesByNeedFlyTimesV2(fromCityToCities,
          currentCity,
          flyTimes - 1,
          flyTimes - 1,
          Lists.newArrayList(fromCity, currentCity),
          assignedCity,
          result2,
          false,
          mustViaSomeCities,
          false,
          true);
    });
    Set<String> onceCanGoToCityList = fromCityToCities.get(fromCity);
    result2.stream()
//        .filter(flyRoad -> {
//          if (flyRoad.size() <= 4) {
//            return true;
//          }
//          List<String> passingCityList = flyRoad.subList(2, flyRoad.size() - 2);
//          return onceCanGoToCityList.stream().allMatch(city -> !passingCityList.contains(city));
//        })
        .filter(flyRoad -> CollectionUtils.isEmpty(mustViaSomeCities) ? true : mustViaSomeCities.stream().allMatch(flyRoad::contains))
        .forEach(road -> {
//          mustViaSomeCities.forEach(needNotShowCity -> road.replaceAll(needNotShowCity, "").replaceAll("->", ""));
          System.out.println(road.stream().collect(Collectors.joining("->")));
          count.incrementAndGet();
        });
    System.out.println("secondCost:" + (System.currentTimeMillis() - now));
    System.out.println("all result2 size=" + result2.size());
    System.out.println("match condition result size=" + count.get());
    System.out.println(fromCityToCities.get(assignedCity));

  }

  private void getTheRestCitiesByNeedFlyTimesV2(
      Map<String, Set<String>> fromCityToCities,
      String currentCity,
      int theRestFlyTimes,
      int totalFlyTimes,
      List<String> currentFlyRoads,
      String theAssignedCity,
      List<List<String>> actualSuccessRoads,
      boolean containsMidway,
      Set<String> mustViaSomeCities,
      boolean needCheckMustPassCity,
      boolean canNotPassRepeatCity) {
    if (theRestFlyTimes < 1) {
      return;
    }
    if (theRestFlyTimes == 1) {
      if (fromCityToCities.get(currentCity) == null) {
//        System.out.println(currentFlyRoad);
        return;
      }
      String existCity = fromCityToCities.get(currentCity).stream().filter(city -> city.contains(theAssignedCity)).findFirst().orElse(null);
      if (existCity != null) {
        currentFlyRoads.add(existCity);
        actualSuccessRoads.add(currentFlyRoads);
      }
      return;
    }
    Set<String> fromCurrentCityCanReachCities = fromCityToCities.get(currentCity);
    if (CollectionUtils.isNotEmpty(fromCurrentCityCanReachCities)) {
      fromCurrentCityCanReachCities.forEach(reachCity -> {
        if (reachCity.contains(theAssignedCity) && containsMidway && totalFlyTimes < 5) {
          List<String> temp = currentFlyRoads.stream().collect(Collectors.toList());
          temp.add(theAssignedCity);
          actualSuccessRoads.add(temp);
        }
        List<String> tempRoad = currentFlyRoads.stream().collect(Collectors.toList());
        if (canNotPassRepeatCity && tempRoad.contains(reachCity)) {
          return;
        }
        if ((tempRoad.size() > 1 && tempRoad.get(tempRoad.size() - 1).equals(theAssignedCity) && !containsMidway)) {
          return;
        }
        if (needCheckMustPassCity && ((mustViaSomeCities.size() - CollectionUtils.disjunction(tempRoad, mustViaSomeCities).size()) >= theRestFlyTimes)) {
          // 效率好像还不如不check
          System.out.println("mustViaSomeCities.contains(reachCity)" + tempRoad.contains(reachCity) + (tempRoad.get(0).equals(theAssignedCity) && !containsMidway));
          return;
        }
        tempRoad.add(reachCity);
        getTheRestCitiesByNeedFlyTimesV2(
            fromCityToCities,
            reachCity,
            theRestFlyTimes - 1,
            totalFlyTimes,
            tempRoad,
            theAssignedCity,
            actualSuccessRoads,
            containsMidway,
            mustViaSomeCities,
            needCheckMustPassCity,
            canNotPassRepeatCity);
      });
    }
  }
}
